<---------prac2b Frame Relay---------------------------------------2B


R1>--------------------------------->
hostname HQ
interface Loopback1
ip address 10.1.1.1 255.255.255.0
ip ospf network point-to-point
interface Serial0/0/1
ip address 10.1.123.1 255.255.255.0
encapsulation frame-relay ietf
ip ospf network point-to-multipoint
frame-relay map ip 10.1.123.1 102
frame-relay map ip 10.1.123.2 102 broadcast
frame-relay map ip 10.1.123.3 103 broadcast
no frame-relay inverse-arp
no shutdown
router ospf 1
network 10.1.1.0 0.0.0.255 area 0
network 10.1.123.0 0.0.0.255 area 0
end

R2>------------------------------------>
hostname EAST
interface Loopback2
ip address 10.1.2.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 10.1.23.2 255.255.255.0
ip ospf dead-interval minimal hello-multiplier 5
no shutdown
interface Serial0/0/1
ip address 10.1.123.2 255.255.255.0
encapsulation frame-relay ietf
clock rate 64000
ip ospf network point-to-multipoint
frame-relay map ip 10.1.123.1 201 broadcast
frame-relay map ip 10.1.123.2 201
frame-relay map ip 10.1.123.3 201 broadcast
no frame-relay inverse-arp
no shutdown
router ospf 1
network 10.1.2.0 0.0.0.255 area 0
network 10.1.23.0 0.0.0.255 area 0
network 10.1.123.0 0.0.0.255 area 0
!
end

R3>------------------------------------->
hostname WEST
interface Loopback3
ip address 10.1.3.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 10.1.23.3 255.255.255.0
ip ospf dead-interval minimal hello-multiplier 5
no shutdown
interface Serial0/0/0
ip address 10.1.123.3 255.255.255.0
encapsulation frame-relay ietf
ip ospf network point-to-multipoint
frame-relay map ip 10.1.123.1 301 broadcast
frame-relay map ip 10.1.123.2 301 broadcast
frame-relay map ip 10.1.123.3 301
no frame-relay inverse-arp
no shutdown
router ospf 1
network 10.1.3.0 0.0.0.255 area 0
network 10.1.23.0 0.0.0.255 area 0
network 10.1.123.0 0.0.0.255 area 0
end

R4>-------------------------------------->
hostname FRS
frame-relay switching
interface Serial0/0/0
no ip address
encapsulation frame-relay ietf
no ip route-cache
clock rate 64000
frame-relay intf-type dce
frame-relay route 102 interface Serial0/0/1 201
frame-relay route 103 interface Serial0/1/0 301
no shutdown
interface Serial0/0/1
no ip address
encapsulation frame-relay ietf
frame-relay intf-type dce
frame-relay route 201 interface Serial0/0/0 102
no shutdown
interface Serial0/1/0
no ip address
encapsulation frame-relay ietf
no ip route-cache
frame-relay intf-type dce
clock rate 64000
frame-relay route 301 interface Serial0/0/0 103
no shutdown
end
