<---------prac1A single area ospf-----------------------------------1A


R1>------------------------------->
hostname R1
interface Loopback1
description Engineering Department
ip address 10.1.1.1 255.255.255.0
interface FastEthernet0/0
ip address 10.1.200.1 255.255.255.0
no shutdown
interface Serial0/0/0
ip address 10.1.100.1 255.255.255.0
clock rate 64000
bandwidth 64
no shutdown
router ospf 1
network 10.1.1.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
network 10.1.200.0 0.0.0.255 area 0
end

R2>------------------------------->
hostname R2
interface Loopback2
description Marketing Department
ip address 10.1.2.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 10.1.200.2 255.255.255.0
no shutdown
interface Serial0/0/0
ip address 10.1.100.2 255.255.255.0
bandwidth 64
no shutdown
router ospf 1
network 10.1.2.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
network 10.1.200.0 0.0.0.255 area 0
end

R3>-------------------------------->
hostname R3
interface Loopback3
description Accounting Department
ip address 10.1.3.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 10.1.200.3 255.255.255.0
no shutdown
router ospf 1
network 10.1.3.0 0.0.0.255 area 0
network 10.1.200.0 0.0.0.255 area 0
end

------Test Network commands------->
set cost ->interface->ip ospf set cost 50
set priority->int->ip ospf set priority 10
verify loopback->show ip ospf interface Lo1
show ip protocols
show ip ospf 
show ip route
show ip ospf neighbor
show ip ospf neighbor detail  
show ip ospf interface brief 



<---------prac1B multiple area ospf----------------------------------1B


R1>------------------------------->
hostname R1
interface Loopback1
description Engineering Department
ip address 10.1.1.1 255.255.255.0
ip ospf network point-to-point
interface Serial0/0/0
ip address 10.1.12.1 255.255.255.0
ip ospf authentication message-digest
ip ospf message-digest-key 1 md5 cisco
clock rate 64000
no shutdown
router ospf 1
network 10.1.1.0 0.0.0.255 area 0
network 10.1.12.0 0.0.0.255 area 0
end

R2>-------------------------------->
hostname R2
interface Loopback2
description Marketing Department
ip address 10.1.2.1 255.255.255.0
ip ospf network point-to-point
interface Serial0/0/0
ip address 10.1.12.2 255.255.255.0
ip ospf authentication message-digest
ip ospf message-digest-key 1 md5 cisco
no shutdown
interface Serial0/0/1
ip address 10.1.23.2 255.255.255.0
ip ospf authentication
ip ospf authentication-key cisco
clock rate 64000
no shutdown
router ospf 1
area 23 nssa no-summary
network 10.1.2.0 0.0.0.255 area 0
network 10.1.12.0 0.0.0.255 area 0
network 10.1.23.0 0.0.0.255 area 23
end

R3>----------------------------------->
hostname R3
interface Loopback3
description Accounting Department
ip address 10.1.3.1 255.255.255.0
ip ospf network point-to-point
interface Loopback20
description Connection to another AS
ip address 172.20.200.1 255.255.255.0
interface Serial0/0/1
ip address 10.1.23.3 255.255.255.0
ip ospf authentication
ip ospf authentication-key cisco
no shutdown
router ospf 1
area 23 nssa
redistribute connected subnets
network 10.1.3.0 0.0.0.255 area 23
network 10.1.23.0 0.0.0.255 area 23
end

------Test Network commands------->
R2->show ip ospf (#nssa area)
R2->show ip ospf database

<---------prac2A virtual link---------------------------------------2A


R1>--------------------------------->
hostname R1
interface Loopback1
description Engineering Department
ip address 10.1.1.1 255.255.255.0
ip ospf network point-to-point
interface Loopback30
ip address 172.30.30.1 255.255.255.252
interface Serial0/0/0
ip address 10.1.12.1 255.255.255.0
clock rate 64000
no shutdown
router ospf 1
network 10.1.1.0 0.0.0.255 area 0
network 10.1.12.0 0.0.0.255 area 0
default-information originate
end

R2>--------------------------------->

hostname R2
interface Loopback2
description Marketing Department
ip address 10.1.2.1 255.255.255.0
ip ospf network point-to-point
interface Serial0/0/0
ip address 10.1.12.2 255.255.255.0
no shutdown
interface Serial0/0/1
ip address 10.1.23.2 255.255.255.0
clock rate 64000
no shutdown
router ospf 1
area 23 virtual-link 192.168.103.1
network 10.1.2.0 0.0.0.255 area 0
network 10.1.12.0 0.0.0.255 area 0
network 10.1.23.0 0.0.0.255 area 23
end

R3>--------------------------------->

hostname R3
interface Loopback3
description Accounting Department
ip address 10.1.3.1 255.255.255.0
ip ospf network point-to-point
interface Loopback100
ip address 192.168.100.1 255.255.255.0
ip ospf network point-to-point
interface Loopback101
ip address 192.168.101.1 255.255.255.0
ip ospf network point-to-point
interface Loopback102
ip address 192.168.102.1 255.255.255.0
ip ospf network point-to-point
interface Loopback103
ip address 192.168.103.1 255.255.255.0
ip ospf network point-to-point
interface Serial0/0/1
ip address 10.1.23.3 255.255.255.0
no shutdown
router ospf 1
area 23 virtual-link 10.1.2.1
area 100 range 192.168.100.0 255.255.252.0
network 10.1.3.0 0.0.0.255 area 23
network 10.1.23.0 0.0.0.255 area 23
network 192.168.100.0 0.0.3.255 area 100
end

<---------prac2b Frame Relay---------------------------------------2B


R1>--------------------------------->
hostname HQ
interface Loopback1
ip address 10.1.1.1 255.255.255.0
ip ospf network point-to-point
interface Serial0/0/1
ip address 10.1.123.1 255.255.255.0
encapsulation frame-relay ietf
ip ospf network point-to-multipoint
frame-relay map ip 10.1.123.1 102
frame-relay map ip 10.1.123.2 102 broadcast
frame-relay map ip 10.1.123.3 103 broadcast
no frame-relay inverse-arp
no shutdown
router ospf 1
network 10.1.1.0 0.0.0.255 area 0
network 10.1.123.0 0.0.0.255 area 0
end

R2>------------------------------------>
hostname EAST
interface Loopback2
ip address 10.1.2.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 10.1.23.2 255.255.255.0
ip ospf dead-interval minimal hello-multiplier 5
no shutdown
interface Serial0/0/1
ip address 10.1.123.2 255.255.255.0
encapsulation frame-relay ietf
clock rate 64000
ip ospf network point-to-multipoint
frame-relay map ip 10.1.123.1 201 broadcast
frame-relay map ip 10.1.123.2 201
frame-relay map ip 10.1.123.3 201 broadcast
no frame-relay inverse-arp
no shutdown
router ospf 1
network 10.1.2.0 0.0.0.255 area 0
network 10.1.23.0 0.0.0.255 area 0
network 10.1.123.0 0.0.0.255 area 0
!
end

R3>------------------------------------->
hostname WEST
interface Loopback3
ip address 10.1.3.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 10.1.23.3 255.255.255.0
ip ospf dead-interval minimal hello-multiplier 5
no shutdown
interface Serial0/0/0
ip address 10.1.123.3 255.255.255.0
encapsulation frame-relay ietf
ip ospf network point-to-multipoint
frame-relay map ip 10.1.123.1 301 broadcast
frame-relay map ip 10.1.123.2 301 broadcast
frame-relay map ip 10.1.123.3 301
no frame-relay inverse-arp
no shutdown
router ospf 1
network 10.1.3.0 0.0.0.255 area 0
network 10.1.23.0 0.0.0.255 area 0
network 10.1.123.0 0.0.0.255 area 0
end

R4>-------------------------------------->
hostname FRS
frame-relay switching
interface Serial0/0/0
no ip address
encapsulation frame-relay ietf
no ip route-cache
clock rate 64000
frame-relay intf-type dce
frame-relay route 102 interface Serial0/0/1 201
frame-relay route 103 interface Serial0/1/0 301
no shutdown
interface Serial0/0/1
no ip address
encapsulation frame-relay ietf
frame-relay intf-type dce
frame-relay route 201 interface Serial0/0/0 102
no shutdown
interface Serial0/1/0
no ip address
encapsulation frame-relay ietf
no ip route-cache
frame-relay intf-type dce
clock rate 64000
frame-relay route 301 interface Serial0/0/0 103
no shutdown
end


<---------prac3a Redistribution rip&ospf---------------------------------------3A


R1>-------------------------------------->
hostname R1
interface Loopback0
ip address 172.16.1.1 255.255.255.0
interface Loopback48
ip address 192.168.48.1 255.255.255.0
interface Loopback49
ip address 192.168.49.1 255.255.255.0
interface Loopback50
ip address 192.168.50.1 255.255.255.0
interface Loopback51
ip address 192.168.51.1 255.255.255.0
interface Loopback70
ip address 192.168.70.1 255.255.255.0
interface Serial0/0/0
ip address 172.16.12.1 255.255.255.0
clock rate 64000
bandwidth 64
no shutdown
router rip
version 2
redistribute static
passive-interface Loopback0
passive-interface Loopback48
passive-interface Loopback49
passive-interface Loopback50
passive-interface Loopback51
passive-interface Loopback70
network 172.16.0.0
network 192.168.48.0
network 192.168.49.0
network 192.168.50.0
network 192.168.51.0
network 192.168.70.0
distribute-list prefix RIP-OUT out Serial0/0/0
no auto-summary
ip route 192.168.48.0 255.255.252.0 Null0


ip prefix-list RIP-OUT seq 5 permit 192.168.48.0/22
ip prefix-list RIP-OUT seq 10 deny 192.168.48.0/22 le 24
ip prefix-list RIP-OUT seq 15 permit 0.0.0.0/0 le 32
end

R2>-------------------------------------->
hostname R2
interface Loopback0
ip address 172.16.2.1 255.255.255.0
interface Serial0/0/0
ip address 172.16.12.2 255.255.255.0
bandwidth 64
no shutdown
interface Serial0/0/1
ip address 172.16.23.2 255.255.255.0
clock rate 64000
bandwidth 64
no shutdown
router ospf 1
redistribute rip metric-type 1 subnets
network 172.16.23.0 0.0.0.255 area 0
default-metric 10000
router rip
version 2
redistribute ospf 1 metric 4
passive-interface Serial0/0/1
passive-interface Loopback0
network 172.16.0.0
no auto-summary
end

R3>-------------------------------------->
hostname R3
interface Loopback0
ip address 172.16.3.1 255.255.255.0
ip ospf network point-to-point
interface Loopback20
ip address 192.168.20.1 255.255.255.0
ip ospf network point-to-point
interface Loopback25
ip address 192.168.25.1 255.255.255.0
ip ospf network point-to-point
interface Loopback30
ip address 192.168.30.1 255.255.255.0
ip ospf network point-to-point
interface Loopback35
ip address 192.168.35.1 255.255.255.0
ip ospf network point-to-point
interface Loopback40
ip address 192.168.40.1 255.255.255.0
ip ospf network point-to-point
interface Serial0/0/1
ip address 172.16.23.3 255.255.255.0
bandwidth 64
no shutdown
router ospf 1
passive-interface default
no passive-interface Serial0/0/1
network 172.16.0.0 0.0.255.255 area 0
network 192.168.0.0 0.0.255.255 area 0
end


<---------prac3b Manipulate Admin Distance---------------------------------------3B


R1>-------------------------------------->
hostname R1
interface Loopback1
ip address 172.16.1.1 255.255.255.0
ip ospf network point-to-point
interface Loopback101
ip address 192.168.101.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 172.16.12.1 255.255.255.0
no shutdown
interface Serial0/0/1
bandwidth 64
ip address 172.16.13.1 255.255.255.0
no shutdown
router ospf 1
network 172.16.0.0 0.0.255.255 area 0
network 192.168.101.0 0.0.0.255 area 0
distance 85 192.168.100.0 0.0.3.255
router rip
version 2
network 172.16.0.0
network 192.168.101.0
distance 100
no auto-summary

access-list 1 permit 172.16.0.0 0.0.255.255
distance 65 0.0.0.0 255.255.255.255 1
end


R2>-------------------------------------->
hostname R2
interface Loopback2
ip address 172.16.2.1 255.255.255.0
ip ospf network point-to-point
interface Loopback102
ip address 192.168.102.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 172.16.12.2 255.255.255.0
no shutdown
interface FastEthernet0/1
ip address 172.16.23.2 255.255.255.0
no shutdown
router ospf 1
network 172.16.0.0 0.0.255.255 area 0
network 192.168.102.0 0.0.0.255 area 0
distance 85 192.168.100.0 0.0.3.255
router rip
version 2
network 172.16.0.0
network 192.168.102.0
distance 100

distance 65 0.0.0.0 255.255.255.255 1
no auto-summary
access-list 1 permit 172.16.0.0 0.0.255.255
end

R3>-------------------------------------->
hostname R3
interface Loopback3
ip address 172.16.3.1 255.255.255.0
ip ospf network point-to-point
interface Loopback103
ip address 192.168.103.1 255.255.255.0
ip ospf network point-to-point
interface FastEthernet0/0
ip address 172.16.23.3 255.255.255.0
no shutdown
interface Serial0/0/0
bandwidth 64
ip address 172.16.13.3 255.255.255.0
clock rate 64000
no shutdown
router ospf 1
network 172.16.0.0 0.0.255.255 area 0
network 192.168.103.0 0.0.0.255 area 0
distance 85 192.168.100.0 0.0.3.255
router rip
version 2
network 172.16.0.0
network 192.168.103.0
distance 100

distance 65 0.0.0.0 255.255.255.255 1
no auto-summary
access-list 1 permit 172.16.0.0 0.0.255.255
end

<---------prac4A Configuring BGP  ---------------------------------------4A


R1>-------------------------------------->
hostname ISP1
interface Loopback0
description ISP1 Internet network
ip address 10.1.1.1 255.255.255.0
interface Loopback100
ip address 192.168.100.1 255.255.255.0
interface Serial0/0/0
description ISP1 -> ITA
ip address 10.0.0.1 255.255.255.252
clock rate 128000
no shutdown
router bgp 200
no synchronization
network 10.1.1.0 mask 255.255.255.0
network 192.168.100.0
neighbor 10.0.0.2 remote-as 100

no auto-summary
end

R2>-------------------------------------->
hostname ITA
interface Loopback0
description Core router network link 1
ip address 192.168.0.1 255.255.255.0
interface Loopback1
description Core router network link 2
ip address 192.168.1.1 255.255.255.0
interface Serial0/0/0
description ITA -> ISP1
ip address 10.0.0.2 255.255.255.252
no shutdown
interface Serial0/0/1
description ITA -> ISP2
ip address 172.16.0.2 255.255.255.252
clock rate 128000
no shutdown
router bgp 100
no synchronization
network 192.168.0.0
network 192.168.1.0

neighbor 10.0.0.1 remote-as 200
neighbor 10.0.0.1 distribute-list 1 out
neighbor 172.16.0.1 remote-as 300
neighbor 172.16.0.1 distribute-list 1 out
no auto-summary
ip default-network 192.168.100.0
ip route 0.0.0.0 0.0.0.0 172.16.0.1 220
access-list 1 permit 192.168.0.0 0.0.1.255
end

R3>-------------------------------------->
hostname ISP2
interface Loopback0
description ISP2 Internet Network
ip address 172.16.1.1 255.255.255.0
interface Serial0/0/1
description ISP2 -> ITA
ip address 172.16.0.1 255.255.255.252
no shutdown
router bgp 300
no synchronization
network 172.16.1.0 mask 255.255.255.0
neighbor 172.16.0.2 remote-as 100

no auto-summary
end


<---------prac5A Config OSPF IPv6 ---------------------------------------5A


R1>-------------------------------------->
hostname R1
ipv6 unicast-routing
ipv6 cef
interface Loopback0
ip address 10.1.1.1 255.255.255.0
ipv6 address FEC0::1:1/112
ipv6 ospf 1 area 0
interface Serial0/0/0
ipv6 address FE80::1 link-local
ipv6 address FEC0::12:1/112
ipv6 ospf 1 area 0
clock rate 64000
bandwidth 64
no shutdown
interface Serial0/0/1
ipv6 address FEC0::13:1/112
ipv6 ospf 1 area 0
bandwidth 64
no shutdown
end

R2>-------------------------------------->
hostname R2
ipv6 unicast-routing
ipv6 cef
interface Loopback0
ip address 10.1.2.1 255.255.255.0
ipv6 address FEC0::2:1/112
ipv6 ospf 1 area 0
interface FastEthernet0/0
ipv6 address FEC0:23::/64 eui-64
ipv6 ospf 1 area 0
no shutdown
interface Serial0/0/0
ipv6 address FEC0::12:2/112
ipv6 address FE80::2 link-local
ipv6 ospf 1 area 0
bandwidth 64
no shutdown
end

R3>-------------------------------------->
hostname R3
ipv6 unicast-routing
ipv6 cef
interface Loopback0
ip address 10.1.3.1 255.255.255.0
ipv6 address FEC0::3:1/112
ipv6 ospf 1 area 0
interface FastEthernet0/0
ipv6 address FEC0:23::/64 eui-64
ipv6 ospf 1 area 0
no shutdown
interface Serial0/0/0
ipv6 address FEC0::13:3/112
ipv6 ospf 1 area 0
clock rate 64000
bandwidth 64
no shutdown
end


<---------prac5B 6-4 tunnel ---------------------------------------5B


R1>-------------------------------------->
hostname R1
ipv6 unicast-routing
interface Loopback0
ip address 10.1.1.1 255.255.255.0
ipv6 address FEC0::1:1/112
interface Loopback11
no ip address
ipv6 address 2002:AC10:C01:11::1/64
interface Loopback12
no ip address
ipv6 address 2002:AC10:C01:12::1/64
interface Tunnel0
ipv6 address 2002:AC10:C01:1::1/64
tunnel source Serial0/0/0
tunnel mode ipv6ip 6to4
interface Serial0/0/0
ip address 172.16.12.1 255.255.255.0
clock rate 64000
bandwidth 64
no shutdown
router eigrp 1
network 10.0.0.0
network 172.16.0.0
no auto-summary
ipv6 route 2002::/16 Tunnel0
ipv6 route FEC0::3:0/112 2002:AC10:1703:1::3
end

R2>-------------------------------------->
hostname R2
interface Loopback0
ip address 10.1.2.1 255.255.255.0
interface Serial0/0/0
ip address 172.16.12.2 255.255.255.0
bandwidth 64
no shutdown
interface Serial0/0/1
ip address 172.16.23.2 255.255.255.0
clock rate 64000
bandwidth 64
no shutdown
router eigrp 1
network 10.0.0.0
network 172.16.0.0
no auto-summary
end

R3>-------------------------------------->
hostname R3
ipv6 unicast-routing
interface Loopback0
ip address 10.1.3.1 255.255.255.0
ipv6 address FEC0::3:1/112
interface Loopback31
no ip address
ipv6 address 2002:AC10:1703:31::1/64
interface Loopback32
no ip address
ipv6 address 2002:AC10:1703:32::1/64
interface Tunnel0
no ip address
ipv6 address 2002:AC10:1703:1::3/64
tunnel source Serial0/0/1
tunnel mode ipv6ip 6to4
interface Serial0/0/1
ip address 172.16.23.3 255.255.255.0
bandwidth 64
no shutdown
router eigrp 1
network 10.0.0.0
network 172.16.0.0
no auto-summary
ipv6 route 2002::/16 Tunnel0
ipv6 route FEC0::1:0/112 2002:AC10:C01:1::1
end


<---------prac 6A ---------------------------------------6A


R1>-------------------------------------->
